# 3. Refine the Data
 
> "Data is messy"

We will be performing the following operation on our Onion price to refine it
- **Remove** e.g. remove redundant data from the data frame
- **Derive** e.g. State and City from the market field
- **Parse** e.g. extract date from year and month column

Other stuff you may need to do to refine are...
- **Missing** e.g. Check for missing or incomplete data
- **Quality** e.g. Check for duplicates, accuracy, unusual data

In [35]:
# Import the two library we need, which is Pandas and Numpy
import pandas as pd
import numpy as np

In [36]:
# Read the csv file of Month Wise Market Arrival data that has been scraped.
df = pd.read_csv('MonthWiseMarketArrivals.csv')

In [37]:
df.head()

       market    month  year  quantity priceMin priceMax priceMod
0  ABOHAR(PB)  January  2005      2350      404      493      446
1  ABOHAR(PB)  January  2006       900      487      638      563
2  ABOHAR(PB)  January  2010       790     1283     1592     1460
3  ABOHAR(PB)  January  2011       245     3067     3750     3433
4  ABOHAR(PB)  January  2012      1035      523      686      605

In [38]:
df.tail()

          market     month   year   quantity  priceMin   priceMax  priceMod
11678  YEOLA(MS)  December   2013     215883       472       1427      1177
11679  YEOLA(MS)  December   2014     201077       446       1654      1456
11680  YEOLA(MS)  December   2015     223315       609       1446      1126
11681  YEOLA(MS)  December   2016     214937       256        753       634
11682        NaN       NaN  Total  862952226  636(Avg)  1187(Avg)  962(Avg)

## REMOVE the redundant data

In [39]:
df.dtypes

market      object
month       object
year        object
quantity     int64
priceMin    object
priceMax    object
priceMod    object
dtype: object

In [40]:
# Delete the last row from the dataframe
df.tail(1)

      market month   year   quantity  priceMin   priceMax  priceMod
11682    NaN   NaN  Total  862952226  636(Avg)  1187(Avg)  962(Avg)

In [41]:
# Delete a row from the dataframe
df.drop(df.tail(1).index, inplace = True)

In [42]:
df.head()

       market    month  year  quantity priceMin priceMax priceMod
0  ABOHAR(PB)  January  2005      2350      404      493      446
1  ABOHAR(PB)  January  2006       900      487      638      563
2  ABOHAR(PB)  January  2010       790     1283     1592     1460
3  ABOHAR(PB)  January  2011       245     3067     3750     3433
4  ABOHAR(PB)  January  2012      1035      523      686      605

In [43]:
df.tail()

          market     month  year  quantity priceMin priceMax priceMod
11677  YEOLA(MS)  December  2012    207066      485     1327     1136
11678  YEOLA(MS)  December  2013    215883      472     1427     1177
11679  YEOLA(MS)  December  2014    201077      446     1654     1456
11680  YEOLA(MS)  December  2015    223315      609     1446     1126
11681  YEOLA(MS)  December  2016    214937      256      753      634

In [46]:
df.dtypes

market      object
month       object
year        object
quantity     int64
priceMin    object
priceMax    object
priceMod    object
dtype: object

In [47]:
df.iloc[:,4:7].head()

  priceMin priceMax priceMod
0      404      493      446
1      487      638      563
2     1283     1592     1460
3     3067     3750     3433
4      523      686      605

In [48]:
df.iloc[:,2:7] = df.iloc[:,2:7].astype(int)

In [50]:
df.dtypes

market      object
month       object
year         int64
quantity     int64
priceMin     int64
priceMax     int64
priceMod     int64
dtype: object

In [19]:
df.drop_duplicates().shape

(11682, 7)

In [51]:
df.shape

(11682, 7)

In [52]:
df.head()

       market    month  year  quantity  priceMin  priceMax  priceMod
0  ABOHAR(PB)  January  2005      2350       404       493       446
1  ABOHAR(PB)  January  2006       900       487       638       563
2  ABOHAR(PB)  January  2010       790      1283      1592      1460
3  ABOHAR(PB)  January  2011       245      3067      3750      3433
4  ABOHAR(PB)  January  2012      1035       523       686       605

In [53]:
df.describe()

               year      quantity      priceMin      priceMax      priceMod
count  11682.000000  1.168200e+04  11682.000000  11682.000000  11682.000000
mean    2009.900531  7.387025e+04    636.061804   1186.928009    962.210923
std        4.708927  1.241064e+05    643.968747    936.274900    780.775832
min     1996.000000  8.000000e+00     16.000000    130.000000     80.000000
25%     2006.000000  7.936750e+03    215.000000    593.250000    470.000000
50%     2010.000000  2.597350e+04    445.000000    928.000000    745.000000
75%     2014.000000  8.330000e+04    825.000000   1450.000000   1191.000000
max     2017.000000  1.974018e+06   6000.000000  12000.000000   7800.000000

## Check for MISSING VALUES

In [54]:
df.isnull().head()

   market  month   year  quantity  priceMin  priceMax  priceMod
0   False  False  False     False     False     False     False
1   False  False  False     False     False     False     False
2   False  False  False     False     False     False     False
3   False  False  False     False     False     False     False
4   False  False  False     False     False     False     False

### Exercise

Check that there are no missing values in the dataframe?

In [56]:
df.head()

       market    month  year  quantity  priceMin  priceMax  priceMod
0  ABOHAR(PB)  January  2005      2350       404       493       446
1  ABOHAR(PB)  January  2006       900       487       638       563
2  ABOHAR(PB)  January  2010       790      1283      1592      1460
3  ABOHAR(PB)  January  2011       245      3067      3750      3433
4  ABOHAR(PB)  January  2012      1035       523       686       605

## DERIVE the states from market names

In [59]:
df.market.value_counts().head()

LASALGAON(MS)     253
PIMPALGAON(MS)    235
MANMAD(MS)        229
LONAND(MS)        222
MAHUVA(GUJ)       221
Name: market, dtype: int64

In [60]:
df['state'] = df.market.str.split('(').str[-1]

In [61]:
df.head()

       market    month  year  quantity  priceMin  priceMax  priceMod state
0  ABOHAR(PB)  January  2005      2350       404       493       446   PB)
1  ABOHAR(PB)  January  2006       900       487       638       563   PB)
2  ABOHAR(PB)  January  2010       790      1283      1592      1460   PB)
3  ABOHAR(PB)  January  2011       245      3067      3750      3433   PB)
4  ABOHAR(PB)  January  2012      1035       523       686       605   PB)

In [62]:
df['city'] = df.market.str.split('(').str[0]

In [63]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city
0,ABOHAR(PB),January,2005,2350,404,493,446,PB),ABOHAR
1,ABOHAR(PB),January,2006,900,487,638,563,PB),ABOHAR
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB),ABOHAR
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB),ABOHAR
4,ABOHAR(PB),January,2012,1035,523,686,605,PB),ABOHAR

In [64]:
df.state.unique()

array(['PB)', 'UP)', 'GUJ)', 'MS)', 'OR)', 'RAJ)', 'WB)', 'BANGALORE',
       'KNT)', 'BHOPAL', 'BHR)', 'Telangana)', 'BULANDSHAHR', 'KER)',
       'CHANDIGARH', 'CHENNAI', 'bellary)', 'podisu)', 'UTT)', 'DELHI',
       'Others)', 'MP)', 'TN)', 'Podis', 'HR)', 'TELANGANA)', 'GUWAHATI',
       'AS)', 'HYDERABAD', 'IMPHAL', 'JAIPUR', 'WHITE)', 'JAMMU',
       'KOLKATA', 'HP)', 'AP)', 'LUCKNOW', 'MUMBAI', 'NAGPUR', 'PATNA',
       'M.P.)', 'RJ)', 'CHATT)', 'CHGARH)', 'JH)', 'SHAHJAHANPUR',
       'SHIMLA', 'SRINAGAR', 'TRIVENDRUM'], dtype=object)

In [65]:
df['state'] = df.state.str.split(')').str[0]

In [67]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR

In [70]:
df.state.unique()

array(['PB', 'UP', 'GUJ', 'MS', 'OR', 'RAJ', 'WB', 'BANGALORE', 'KNT',
       'BHOPAL', 'BHR', 'Telangana', 'BULANDSHAHR', 'KER', 'CHANDIGARH',
       'CHENNAI', 'bellary', 'podisu', 'UTT', 'DELHI', 'Others', 'MP',
       'TN', 'Podis', 'HR', 'TELANGANA', 'GUWAHATI', 'AS', 'HYDERABAD',
       'IMPHAL', 'JAIPUR', 'WHITE', 'JAMMU', 'KOLKATA', 'HP', 'AP',
       'LUCKNOW', 'MUMBAI', 'NAGPUR', 'PATNA', 'M.P.', 'RJ', 'CHATT',
       'CHGARH', 'JH', 'SHAHJAHANPUR', 'SHIMLA', 'SRINAGAR', 'TRIVENDRUM'], dtype=object)

In [71]:
dfState = df.groupby(['state', 'market'], as_index=False).count()

In [72]:
dfState.market.unique()

array(['KURNOOL(AP)', 'MADANAPALLE (AP)', 'MULAKALACHERUVU (AP)',
       'MYDUKUR(AP)', 'PALAMANER (AP)', 'RAJAHMUNDRY(AP)',
       'SADASIVPET(AP)', 'HOWLY (AS)', 'BANGALORE', 'BHOPAL',
       'BIHARSHARIF(BHR)', 'BULANDSHAHR', 'CHANDIGARH', 'RAIGARH (CHATT)',
       'TIPHRA (CHATT)', 'CHENNAI', 'RAIPUR(CHGARH)', 'DELHI',
       'AHMEDABAD(GUJ)', 'BHAVNAGAR(GUJ)', 'DEESA(GUJ)', 'GONDAL(GUJ)',
       'JAMNAGAR(GUJ)', 'MAHUVA(GUJ)', 'RAJKOT(GUJ)', 'SURAT(GUJ)',
       'VADODARA(GUJ)', 'GUWAHATI', 'KULLU(HP)', 'SOLAN (HP)',
       'FARIDABAD (HR)', 'GURGAON(HR)', 'KARNAL(HR)', 'HYDERABAD',
       'IMPHAL', 'JAIPUR', 'JAMMU', 'RANCHI(JH)', 'CHALA (KER)',
       'PALAYAM(KER)', 'BELGAUM(KNT)', 'BIJAPUR(KNT)', 'BINNY MILL (KNT)',
       'CHALLAKERE(KNT)', 'CHICKBALLAPUR(KNT)', 'DHAVANGERE(KNT)',
       'GUNDLUPET (KNT)', 'HASSAN(KNT)', 'HUBLI(KNT)', 'KOLAR(KNT)',
       'MYSORE -BANDIPALYA (KNT)', 'RAICHUR(KNT)', 'SRINIVASAPUR (KNT)',
       'SRINIVASPUR (KNT)', 'KOLKATA', 'LUCKNOW', 'PIPLYA (M.P.)',
       'DEWAS(MP)', 'INDORE(MP)', 'JABALPUR (MP)', 'KHANDWA(MP)',
       'MANDSOUR(MP)', 'NEEMUCH(MP)', 'RATLAM(MP)', 'SAGAR(MP)',
       'SHAJAPURF&V) (MP)', 'SHIVPURI(F&V) (MP)', 'UJJAIN(MP)',
       'AHMEDNAGAR(MS)', 'AURANGABAD(MS)', 'BOMBORI(MS)', 'CHAKAN(MS)',
       'CHANDRAPUR-GANJWAD (MS)', 'CHANDVAD(MS)', 'DEVALA(MS)',
       'DHULIA(MS)', 'DINDORI(MS)', 'JALGAON(MS)', 'JUNNAR(MS)',
       'KALVAN(MS)', 'KOLHAPUR(MS)', 'KOPERGAON(MS)', 'LASALGAON(MS)',
       'LONAND(MS)', 'MALEGAON(MS)', 'MANMAD(MS)', 'NAMPUR(MS)',
       'NANDGAON(MS)', 'NASIK(MS)', 'NEWASA(MS)', 'NIPHAD(MS)',
       'PHALTAN (MS)', 'PIMPALGAON(MS)', 'PUNE(MS)', 'RAHATA(MS)',
       'RAHURI(MS)', 'SAIKHEDA(MS)', 'SAKRI(MS)', 'SANGALI(MS)',
       'SANGAMNER(MS)', 'SATANA(MS)', 'SHRIRAMPUR(MS)', 'SINNAR(MS)',
       'SOLAPUR(MS)', 'SRIRAMPUR(MS)', 'VANI(MS)', 'YEOLA(MS)', 'MUMBAI',
       'NAGPUR', 'AIGINIA MANDIA (OR)', 'ANGUL(OR)', 'BAMPADA(OR)',
       'BARGARH(OR)', 'BETNOTI(OR)', 'BHUBNESWER(OR)', 'HINJILICUT (OR)',
       'JATNI(OR)', 'DELHI (Others)', 'PATNA', 'ABOHAR(PB)',
       'AMRITSAR(PB)', 'BHATINDA(PB)', 'FIROZEPURCITY(PB)',
       'HOSHIARPUR(PB)', 'JALANDHAR(PB)', 'KHANNA(PB)', 'LUDHIANA(PB)',
       'PANIPAT(PB)', 'PATHANKOT(PB)', 'PATIALA(PB)', 'DINDIGUL(TN)(Podis',
       'AJMER(RAJ)', 'ALWAR(RAJ)', 'BIKANER(RAJ)', 'CHOMU(RAJ)',
       'JODHPUR(RAJ)', 'KOTA(RAJ)', 'SRIGANGANAGAR(RAJ)', 'UDAIPUR(RAJ)',
       'PRATAPGARH (RJ)', 'SHAHJAHANPUR', 'SHIMLA', 'SRINAGAR',
       'GUDIMALKAPUR (TELANGANA)', 'L B NAGAR (TELANGANA)', 'DINDIGUL(TN)',
       'MADURAI(TN)', 'TRIVENDRUM', 'BOWENPALLY(Telangana)', 'AGRA(UP)',
       'ALIGARH(UP)', 'ALLAHABAD(UP)', 'BALLIA(UP)', 'BAREILLY(UP)',
       'DEORIA(UP)', 'ETAH (UP)', 'ETAWAH(UP)', 'FAIZABAD(UP)',
       'FARUKHABAD(UP)', 'GHAZIABAD (UP)', 'GORAKHPUR(UP)', 'JAUNPUR (UP)',
       'JHANSI(UP)', 'KANPUR(UP)', 'MAINPURI (UP)', 'MATHURA (UP)',
       'MEERUT(UP)', 'SAHARANPUR(UP)', 'SITAPUR(UP)', 'VARANASI(UP)',
       'DEHRADOON(UTT)', 'HALDWANI(UTT)', 'ASANSOL (WB)', 'BURDWAN(WB)',
       'MIDNAPUR(WB)', 'PURULIA(WB)', 'SHEROAPHULY(WB)', 'JALGAON(WHITE)',
       'COIMBATORE(TN) (bellary)', 'COIMBATORE(TN) (podisu)'], dtype=object)

In [73]:
df.state.unique()

array(['PB', 'UP', 'GUJ', 'MS', 'OR', 'RAJ', 'WB', 'BANGALORE', 'KNT',
       'BHOPAL', 'BHR', 'Telangana', 'BULANDSHAHR', 'KER', 'CHANDIGARH',
       'CHENNAI', 'bellary', 'podisu', 'UTT', 'DELHI', 'Others', 'MP',
       'TN', 'Podis', 'HR', 'TELANGANA', 'GUWAHATI', 'AS', 'HYDERABAD',
       'IMPHAL', 'JAIPUR', 'WHITE', 'JAMMU', 'KOLKATA', 'HP', 'AP',
       'LUCKNOW', 'MUMBAI', 'NAGPUR', 'PATNA', 'M.P.', 'RJ', 'CHATT',
       'CHGARH', 'JH', 'SHAHJAHANPUR', 'SHIMLA', 'SRINAGAR', 'TRIVENDRUM'], dtype=object)

In [74]:
state_now = ['PB', 'UP', 'GUJ', 'MS', 'OR', 'RAJ', 'WB', 'BANGALORE', 'KNT',
       'BHOPAL', 'BHR', 'Telangana', 'BULANDSHAHR', 'KER', 'CHANDIGARH',
       'CHENNAI', 'bellary', 'podisu', 'UTT', 'DELHI', 'Others', 'MP',
       'TN', 'Podis', 'HR', 'TELANGANA', 'GUWAHATI', 'AS', 'HYDERABAD',
       'IMPHAL', 'JAIPUR', 'WHITE', 'JAMMU', 'KOLKATA', 'HP', 'AP',
       'LUCKNOW', 'MUMBAI', 'NAGPUR', 'PATNA', 'M.P.', 'RJ', 'CHATT',
       'CHGARH', 'JH', 'SHAHJAHANPUR', 'SHIMLA', 'SRINAGAR', 'TRIVENDRUM']

In [75]:
state_new =['PB', 'UP', 'GJ', 'MH', 'OR', 'RJ', 'WB', 'KT', 'KT',
       'MP', 'BH', 'TL', 'UP', 'KR', 'CG',
       'TN', 'TN', 'TN', 'UP', 'DL', 'DL', 'MP',
       'TN', 'TN', 'HR', 'TL', 'AS', 'AS', 'TL',
       'MG', 'RJ', 'MH', 'JK', 'WB', 'HP', 'AP',
       'UP', 'MH', 'MH', 'BH', 'MP', 'RJ', 'CH',
       'CG', 'JH', 'UP', 'HP', 'JK', 'KR']

In [76]:
df.state = df.state.replace(state_now, state_new)

In [77]:
df.state.unique()

array(['PB', 'UP', 'GJ', 'MH', 'OR', 'RJ', 'WB', 'KT', 'MP', 'BH', 'TL',
       'KR', 'CG', 'TN', 'DL', 'HR', 'AS', 'MG', 'JK', 'HP', 'AP', 'CH',
       'JH'], dtype=object)

## PARSE TO get the Dates

In [78]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR

In [79]:
df.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            11672, 11673, 11674, 11675, 11676, 11677, 11678, 11679, 11680,
            11681],
           dtype='int64', length=11682)

In [80]:
pd.to_datetime('January 2012')

Timestamp('2012-01-01 00:00:00')

In [81]:
df['date'] = df['month'] + '-' + df['year'].map(str)

In [82]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,January-2005
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,January-2006
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,January-2010
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,January-2011
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,January-2012

In [60]:
??map

In [61]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,January-2005
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,January-2006
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,January-2010
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,January-2011
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,January-2012

In [89]:
df.date = pd.to_datetime(df.date)

In [90]:
index = pd.to_datetime(df.date)

In [91]:
df.index = pd.PeriodIndex(df.date, freq='M')

In [92]:
type(df.date)

pandas.core.series.Series

In [93]:
df.dtypes

market              object
month               object
year                 int64
quantity             int64
priceMin             int64
priceMax             int64
priceMod             int64
state               object
city                object
date        datetime64[ns]
dtype: object

In [85]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
date,,,,,,,,,,
2005-01,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,January-2005
2006-01,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,January-2006
2010-01,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,January-2010
2011-01,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,January-2011
2012-01,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,January-2012

In [64]:
df.columns

Index(['market', 'month', 'year', 'quantity', 'priceMin', 'priceMax',
       'priceMod', 'state', 'city', 'date'],
      dtype='object')

In [57]:
df.index

PeriodIndex(['2005-01', '2006-01', '2010-01', '2011-01', '2012-01', '2013-01',
             '2014-01', '2015-01', '2017-01', '2005-02',
             ...
             '2007-12', '2008-12', '2009-12', '2010-12', '2011-12', '2012-12',
             '2013-12', '2014-12', '2015-12', '2016-12'],
            dtype='period[M]', name='date', length=11682, freq='M')

In [58]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
date,,,,,,,,,,
2005-01,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,January-2005
2006-01,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,January-2006
2010-01,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,January-2010
2011-01,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,January-2011
2012-01,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,January-2012

In [59]:
df.to_csv('MonthWiseMarketArrivals_Clean.csv', index = False)